


console.log("loaded additionalKMS.js");

const additionalKMS = {};

additionalKMS.init = function(){
  const data = this;
  
  /* 公式を確認した日付 */
  data.date = new Date("2023 12 20 GMT+0900");
  
  /*
    参考元(公式)
    https://maplestory.nexon.com/Guide/OtherProbability/cube/addi
    https://maplestory.nexon.com/Guide/OtherProbability/cube/strangeAddi
  */
  
  /*==================== キューブの設定 =============================================*/
  (()=>{
    /**
    * キューブの種類>潜在等級>各行の同等級付与率
    * 汎用処理で[同等級率, 下位等級率]に書き換える
    */
    data.ratetable = {
      "additional" : [
          [1, 0.004975, 0.004975]
        , [1, 0.019608, 0.019608]
        , [1, 0.047619, 0.047619]
        , [1, 0.019608, 0.019608]
      ]
      , "whiteadditional" : [
          [1, 0.004975, 0.004975]
        , [1, 0.019608, 0.019608]
        , [1, 0.047619, 0.047619]
        , [1, 0.019608, 0.019608]
      ]
      , "rareadditional" : [
          
        , 
        , [1, 0.004000, 0.004000]
        , [1, 0.019608, 0.019608]
      ]
    };
    data.upgradetable = {
        "additional"      : [0, 0.007, 0.019608, 0.047619]
      , "whiteadditional" : [0, 0.007, 0.019608, 0.047619]
      , "rareadditional"  : [0, 0, 0, 0.004]
    };
    data.images = {
        "additional"      : "additional.png"
      , "whiteadditional" : "whiteadditional.png"
      , "rareadditional"  : "rareadditional.png"
    };

    data.weights = {};
    data.weights["additional"]
    = data.weights["whiteadditional"]
    = data.weights["rareadditional"] = [];
    with(commons.consts){
      let ws = data.weights["additional"];
      
      ws[pstr1] = [2,2,2,2,]; ws[pdex1] = ws[pint1] = ws[pluk1] = ws[pstr1];
      ws[pstr2] = [3,3,3,2,]; ws[pdex2] = ws[pint2] = ws[pluk2] = ws[pstr2]; /* 武器系 */
      ws[pall1] = [2,2,2,,];
      ws[pall2] = [2,2,2,,]; /* 武器系 */
      ws[patk]  = [2,2,2,1,]; ws[pma]  = ws[patk];
      
      ws[lvstr] = [2,2,,,]; ws[lvdex] = ws[lvint] = ws[lvluk] = ws[lvstr];
      ws[istr1] = [3,3,3,3,2]; ws[idex1] = ws[iint1] = ws[iluk1] = ws[istr1];
      ws[istr2] = [,,,3,2]; ws[idex2] = ws[iint2] = ws[iluk2] = ws[istr2]; /* 武器系 */
      ws[iall1] = [,,,2,];
      ws[iall2] = [,,,3,]; /* 武器系 */
      ws[iatk1] = [2,2,2,2,2]; ws[ima1]  = ws[iatk1];
      ws[iatk2] = [1,,,2,2]; ws[ima2]  = ws[iatk2]; /* 武器系 */
      
      ws[php]  = [3,3,3,2,]; ws[pmp]  = ws[php];
      ws[ihp]  = [3,3,3,3,3]; ws[imp]  = ws[ihp];
      
      ws[pcri]  = [2,2,1,2,];
      ws[pcrd1] = [2,,,,];
      ws[pcrd2] = [2,,,,]; /* 手袋3% */
      
      ws[pdam]   = [1,1,1,1,];
      ws[pboss1] = [1,1,,,];
      ws[pboss2] = [,,,,];
      ws[pign1]  = [1,1,2,,];
      ws[pign2]  = [,,,,];
      
      ws[ict1]  = [3,,,,];
      ws[ict2]  = [,,,,];
      
      ws[ohp1]  = [,3,,,]; ws[omp1]  = ws[ohp1]; /* 15% */
      ws[ohp2]  = [,,3,,]; ws[omp2]  = ws[ohp2]; /* 3% */
      ws[oehp]  = [,,,,]; ws[oemp] = ws[oehp];
      ws[orhp]  = [,,,,]; ws[ormp] = ws[orhp];
      
      ws[oeff]  = [3,3,,,];
      
      ws[oinv]  = [,,,,];
      ws[opinv] = [,,,,];
      
      ws[opsn1]  = [,,,,]; ws[ostn1] = ws[oslw1] = ws[oblk1] = ws[ofrz1] = ws[oseal1] = ws[opsn1];
      ws[opsn2]  = [,,,,]; ws[ostn2] = ws[oslw2] = ws[oblk2] = ws[ofrz2] = ws[oseal2] = ws[opsn2];
      
      ws[oemo1] = [,,,,]; ws[oemo2] = ws[oemo3] = ws[oemo4] = ws[oemo5] = ws[oemo1];
      
      ws[ostl1] = [,,,,]; ws[ostl2] = ws[ostl3] = ws[ostl1];
      
      ws[ispd]  = [,,3,3,3]; ws[ijmp] = ws[ispd];
      
      ws[pigndam1] = [,,,,];
      ws[pigndam2] = [,,,,];
      ws[iigndam1] = [,,,,];
      ws[iigndam2] = [,,,,];
      ws[iigndam3] = [,,,,];
      ws[prefdam1] = [,,,,];
      ws[prefdam2] = [,,,,];
      
      ws[pdef]  = [,,3,2,];
      ws[idef]  = [,,3,3,3];
      
      ws[pdmp1] = [3,,,,];
      ws[pdmp2] = [,,,,];
      
      ws[pdrop] = [3,,,,]; ws[pmeso] = ws[pdrop];
      
      ws[spwb]  = [,,,,];
      ws[spse]  = [,,,,];
      ws[spab]  = [,,,,];
      ws[spco]  = [,,,,];
      ws[sphb]  = [,,,,];
      ws[spht]  = [,,,,];
      ws[spmd]  = [,,,,];
    }
    
    
    /*================== 装備別潜在設定 ===================================================================*/
    with(commons.consts){
      /* [].del([]) : filterの簡略化 */
      Array.prototype.del = function(arr){return this.filter( e => !arr.includes(e) )};
      
      /* 設定用テンプレート */
      const pstatus1 = [pstr1, pdex1, pint1, pluk1]
      ,     pstatus2 = [pstr2, pdex2, pint2, pluk2]
      ,     lvstatus = [lvstr, lvdex, lvint, lvluk]
      ,     istatus1 = [istr1, idex1, iint1, iluk1]
      ,     istatus2 = [istr2, idex2, iint2, iluk2]
      ,     obads1   = [opsn1, ostn1, oslw1, oblk1, ofrz1, oseal1]
      ,     obads2   = [opsn2, ostn2, oslw2, oblk2, ofrz2, oseal2]
      ,     oemos  = [oemo1, oemo2, oemo3, oemo4, oemo5]
      ;
      
      data.equipmentpotential = {};
      let list;
      
      /*----------------- 共通キューブ装備別潜在 ------------------------------------------------------------*/
      list = [];
      data.equipmentpotential["additional"]
      = data.equipmentpotential["whiteadditional"]
      = data.equipmentpotential["rareadditional"]
      = list;
      list[武器] = [];
      list[武器][レジェ]       = [].concat(pstatus2, pall2, patk, pma, lvstatus, iatk2, ima2, php, pmp, pcri, pdam, pboss1, pign1);
      list[武器][ユニ]         = [].concat(pstatus2, pall2, patk, pma, lvstatus, php, pmp, pcri, pdam, pboss1, pign1, ohp1, omp1);
      list[武器][エピ]         = [].concat(pstatus2, pall2, patk, pma, php, pmp, pcri, pdam, pign1, ohp2, omp2);
      list[武器][レア]         = [].concat(pstatus2, patk, pma, istatus2, iall2, iatk2, ima2, php, pmp, ihp, imp, pcri, pdam, idef, ispd, ijmp);
      list[武器][ノマ]         = [].concat(istatus2, iatk2, ima2, ihp, imp, idef, ispd, ijmp);
      
      list[エンブレム] = [];
      list[エンブレム][レジェ] = list[武器][レジェ].del([pboss1]);
      list[エンブレム][ユニ]   = list[武器][ユニ].del([pboss1]);
      list[エンブレム][エピ]   = list[武器][エピ];
      list[エンブレム][レア]   = list[武器][レア];
      list[エンブレム][ノマ]   = list[武器][ノマ];
      
      list[補助武器] = [];
      list[補助武器][レジェ]   = list[武器][レジェ].concat(pcrd1);
      list[補助武器][ユニ]     = list[武器][ユニ];
      list[補助武器][エピ]     = list[武器][エピ];
      list[補助武器][レア]     = list[武器][レア];
      list[補助武器][ノマ]     = list[武器][ノマ];
      
      list[フォース] = list[補助武器]; /* アディはMPがそのまま */
      
      list[盾] = list[補助武器];
      
      list[帽子] = [];
      list[帽子][レジェ]   = [].concat(pstatus1, pall1, lvstatus, istatus1, iatk1, ima1, pcrd1, php, pmp, ihp, imp, ict1, oeff, pmeso, pdrop);
      list[帽子][ユニ]     = [].concat(pstatus1, pall1, lvstatus, istatus1, iatk1, ima1,        php, pmp, ihp, imp, oeff);
      list[帽子][エピ]     = [].concat(pstatus1, pall1,           istatus1, iatk1, ima1,        php, pmp, ihp, imp, pdef, idef, ispd, ijmp);
      list[帽子][レア]     = [].concat(pstatus1,                  istatus1, iatk1, ima1, iall1, php, pmp, ihp, imp, pdef, idef, ispd, ijmp);
      list[帽子][ノマ]     = [].concat(istatus1, iatk1, ima1, ihp, imp, idef, ispd, ijmp);
      
      list[服上] = [];
      list[服上][レジェ]   = list[帽子][レジェ].del([ict1]);
      list[服上][ユニ]     = list[帽子][ユニ];
      list[服上][エピ]     = list[帽子][エピ];
      list[服上][レア]     = list[帽子][レア];
      list[服上][ノマ]     = list[帽子][ノマ];
      
      list[服全身]         = list[服上];
      
      list[服下]           = list[服上];
      
      list[靴]             = list[服上];
      
      list[手袋] = [];
      list[手袋][レジェ]   = list[帽子][レジェ].del([ict1]).concat(pcrd2);
      list[手袋][ユニ]     = list[帽子][ユニ];
      list[手袋][エピ]     = list[帽子][エピ];
      list[手袋][レア]     = list[帽子][レア];
      list[手袋][ノマ]     = list[帽子][ノマ];
      
      list[マント]         = list[服上];
      
      list[ベルト]         = list[服上];
      
      list[肩]             = list[服上];
      
      list[顔飾り] = [];
      list[顔飾り][レジェ] = list[帽子][レジェ].del([ict1, pcrd1]).concat(pdmp1);
      list[顔飾り][ユニ]   = list[帽子][ユニ];
      list[顔飾り][エピ]   = list[帽子][エピ];
      list[顔飾り][レア]   = list[帽子][レア];
      list[顔飾り][ノマ]   = list[帽子][ノマ];
      
      list[目飾り]     = list[顔飾り];
      list[イヤリング] = list[顔飾り];
      list[指輪]       = list[顔飾り];
      list[ペンダント] = list[顔飾り];
      
      list[機械心臓] = [];
      list[機械心臓][レジェ] = list[帽子][レジェ].del([ict1, pcrd1]);
      list[機械心臓][ユニ]   = list[帽子][ユニ];
      list[機械心臓][エピ]   = list[帽子][エピ];
      list[機械心臓][レア]   = list[帽子][レア];
      list[機械心臓][ノマ]   = list[帽子][ノマ];
    }
  })();


  /*========================= 潜在能力の設定 =================================================*/
  /**
  *[ 潜在重要度(0職業によっては必須, 1小さい影響, 2影響なし不要)
  *, レジェ[確率比重, [レベル閾値, 潜在数値]...]
  *, ユニ[], エピ[], レア[], ノマ[]
  *]
  */
  data.potentialinfotemplate = {
    "% STR1" : [ 0 /*共通 %DEX %INT %LUK 防具系*/
    , [/*レジェ*/
        [0, 3], [21, 4], [51, 5], [91, 8], [201, 9]
      ]
    , [/*ユニ*/
        [0, 2], [21, 3], [51, 4], [91, 6], [201, 7]
      ]
    , [/*エピ*/
        [0, 1], [21, 2], [51, 3], [91, 4], [201, 5]
      ]
    , [/*レア*/
        [0, 1], [91, 2], [201, 3]
      ]
    , [/*ノーマル*/]
    ]
  , "% STR2" : [ 0 /*共通 %DEX %INT %LUK 武器系*/
    , [/*レジェ*/
        [0, 6], [31, 9], [71, 12]
      ]
    , [/*ユニ*/
        [0, 6], [31, 6], [71, 9]
      ]
    , [/*エピ*/
        [0, 2], [31, 4], [71, 6]
      ]
    , [/*レア*/
        [0, 1], [31, 2], [71, 3]
      ]
    , [/*ノーマル*/]
    ]
  , "% オールステータス1" : [ 0 /* 防具系 */
    , [/*レジェ*/
        [0, 3], [21, 4], [51, 5], [91, 8], [201, 9]
      ]
    , [/*ユニ*/
        [0, 2], [21, 3], [51, 4], [91, 6], [201, 7]
      ]
    , [/*エピ*/
        [0, 3], [21, 4], [51, 5], [91, 8], [201, 9]
      ]
    , [/*レア*/
        [0, 1], [21, 2], [51, 3], [91, 4], [201, 5]
      ]
    , [/*ノーマル*/
        [0, 1], [91, 2], [201, 3]
      ]
    ]
  , "% オールステータス2" : [ 0 /* 武器系 */
    , [/*レジェ*/
        [0, 3], [31, 6], [71, 9]
      ]
    , [/*ユニ*/
        [0, 2], [31, 4], [71, 6]
      ]
    , [/*エピ*/
        [0, 1], [31, 2], [71, 3]
      ]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% 攻撃力" : [ 0 /*共通 %魔力*/
    , [/*レジェ*/
        [0, 6], [31, 9], [71, 12]
      ]
    , [/*ユニ*/
        [0, 6], [31, 6], [71, 9]
      ]
    , [/*エピ*/
        [0, 2], [31, 4], [71, 6]
      ]
    , [/*レア*/
        [0, 1], [31, 2], [71, 3]
      ]
    , [/*ノーマル*/]
    ]
  , "STR レベル9当たり" : [ 0 /* 共通 DEX INT LUK */
    , [/*レジェ*/
        [30, 2]
      ]
    , [/*ユニ*/
        [30, 1]
      ]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "STR1" : [ 1 /*共通 DEX INT LUK 防具系*/
    , [/*レジェ*/
        [0, 8], [21, 10], [41, 12], [51, 14], [71, 16], [91, 20], [201, 21]
      ]
    , [/*ユニ*/
        [0, 6], [21, 8], [41, 10], [51, 12], [71, 14], [91, 18], [201, 19]
      ]
    , [/*エピ*/
        [0, 4], [21, 6], [41, 8], [51, 10], [71, 12], [91, 14], [201, 15]
      ]
    , [/*レア*/
        [0, 2], [21, 4],          [51, 6], [71, 8], [91, 10], [201, 11]
      ]
    , [/*ノーマル*/
        [0, 1], [21, 2], [41, 3], [51, 4], [71, 5], [91,  6]
      ]
    ]
  , "STR2" : [ 1 /*共通 DEX INT LUK 武器系*/
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/
        [0, 2], [21, 4], [41, 6], [51, 8], [71, 10], [91, 12]
      ]
    , [/*ノーマル*/
        [0, 1], [21, 2], [41, 3], [51, 4], [71, 5], [91,  6]
      ]
    ]
  , "オールステータス1" : [ 1 /* 防具系 */
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/
        [0, 1], [51, 2], [91, 3], [201, 4]
      ]
    , [/*ノーマル*/]
    ]
  , "オールステータス2" : [ 1 /* 武器系 */
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/
        [0, 1], [21, 2], [41, 3],[61, 4], [81, 5]
      ]
    , [/*ノーマル*/]
    ]
  , "攻撃力1" : [ 0 /*共通 魔力 防具系 優先度上げる*/
    , [/*レジェ*/
        [0, 8], [21, 10], [51, 12], [91, 16], [201, 17]
      ]
    , [/*ユニ*/
        [0, 6], [21, 8], [51, 10], [91, 14], [201, 15]
      ]
    , [/*エピ*/
        [0, 4], [21, 6], [51, 8], [91, 11], [201, 12]
      ]
    , [/*レア*/
        [0, 1], [21, 2], [41, 4], [61, 6], [81, 8], [91, 10], [201, 11]
      ]
    , [/*ノーマル*/
        [0, 1], [51, 2], [101, 3]
      ]
    ]
  , "攻撃力2" : [ 0 /*共通 魔力 武器系 優先度上げる*/
    , [/*レジェ*/
        [30, 32] /*固定値*/
      ]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/
        [0, 2], [21, 4], [41, 6], [61, 8], [81, 10], [91, 12]
      ]
    , [/*ノーマル*/
        [0, 1], [21, 2], [41, 3], [61, 4], [81, 5], [91, 6]
      ]
    ]
    
    
  , "% HP" : [ 0 /*優先度以外共通 MP%*/
    , [/*レジェ*/
        [0, 3], [21, 5], [51, 7], [91, 11], [201, 12]
      ]
    , [/*ユニ*/
        [0, 2], [21, 3], [51, 5], [91, 8], [201, 9]
      ]
    , [/*エピ*/
        [0, 1], [21, 2], [51, 3], [91, 5], [201, 6]
      ]
    , [/*レア*/
        [0, 1],                   [91, 2], [201, 3]
      ]
    , [/*ノーマル*/]
    ]
  , "% MP" : [ 2 /*優先度以外共通 HP%*/
    , [/*レジェ*/
        [0, 3], [21, 5], [51, 7], [91, 11], [201, 12]
      ]
    , [/*ユニ*/
        [0, 2], [21, 3], [51, 5], [91, 8], [201, 9]
      ]
    , [/*エピ*/
        [0, 1], [21, 2], [51, 3], [91, 5], [201, 6]
      ]
    , [/*レア*/
        [0, 1],                   [91, 2], [201, 3]
      ]
    , [/*ノーマル*/]
    ]
  , "HP" : [ 1 /*優先度以外共通 MP*/
    , [/*レジェ*/
        [0, 25], [11, 50], [21, 75], [31, 100], [41, 125], [51, 150], [61, 175], [71, 200], [81, 225], [91, 360], [201, 375]
      ]
    , [/*ユニ*/
        [0, 20], [11, 40], [21, 60], [31,  80], [41, 100], [51, 120], [61, 140], [71, 160], [81, 180], [91, 300], [201, 315]]
      
    , [/*エピ*/
        [0, 15], [11, 30], [21, 45], [31,  60], [41, 75], [51, 90], [61, 105], [71, 120], [81, 135], [91, 150], [101, 165], [111, 180], [201, 195]
      ]
    , [/*レア*/
        [0, 10], [21, 15], [51, 50], [91, 100], [201, 125]
      ]
    , [/*ノーマル*/
        [0, 5], [11, 10], [21, 15], [31,  20], [41, 25], [51, 30], [61, 35], [71, 40], [81, 45], [91, 50], [101, 55], [111, 60]
      ]
    ]
  , "MP" : [ 2 /*優先度以外共通 MP*/
    , [/*レジェ*/
        [0, 25], [11, 50], [21, 75], [31, 100], [41, 125], [51, 150], [61, 175], [71, 200], [81, 225], [91, 360], [201, 375]
      ]
    , [/*ユニ*/
        [0, 20], [11, 40], [21, 60], [31,  80], [41, 100], [51, 120], [61, 140], [71, 160], [81, 180], [91, 300], [201, 315]
      ]
    , [/*エピ*/
        [0, 15], [11, 30], [21, 45], [31,  60], [41, 75], [51, 90], [61, 105], [71, 120], [81, 135], [91, 150], [101, 165], [111, 180], [201, 195]
      ]
    , [/*レア*/
        [0, 10], [21, 15], [51, 50], [91, 100], [201, 125]
      ]
    , [/*ノーマル*/
        [0, 5], [11, 10], [21, 15], [31,  20], [41, 25], [51, 30], [61, 35], [71, 40], [81, 45], [91, 50], [101, 55], [111, 60]
      ]
    ]
    
    
  , "% クリティカル率" : [ 1
    , [/*レジェ*/
        [0, 6], [31, 9], [71, 12]
      ]
    , [/*ユニ*/
        [0, 3], [31, 6], [71, 9]
      ]
    , [/*エピ*/
        [0, 2], [31, 4], [71, 6]
      ]
    , [/*レア*/
        [0, 1], [31, 2], [71, 3], [101, 4]
      ]
    , [/*ノーマル*/]
    ]
  , "% クリティカルダメージ1" : [ 0 /* 汎用 */
    , [/*レジェ*/
        [0, 1]
      ]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% クリティカルダメージ2" : [ 0 /* 手袋 */
    , [/*レジェ*/
        [0, 1], [21, 2], [91, 3]
      ]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% ダメージ" : [ 0
    , [/*レジェ*/
        [0, 6], [31, 9], [71, 12]
      ]
    , [/*ユニ*/
        [0, 3], [31, 6], [71, 9]
      ]
    , [/*エピ*/
        [0, 2], [31, 4], [71, 6]
      ]
    , [/*レア*/
        [0, 1], [31, 2], [71, 3]
      ]
    , [/*ノーマル*/]
    ]
  , "% ボスダメージ1" : [ 0
    , [/*レジェ*/
        [50, 18]
      ]
    , [/*ユニ*/
        [50, 12]
      ]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% ボスダメージ2" : [ 0 /*武器系レジェ40%*/
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% 防御率無視1" : [ 0
    , [/*レジェ*/
        [50, 5]
      ]
    , [/*ユニ*/
        [50, 4]
      ]
    , [/*エピ*/
        [50, 3]
      ]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% 防御率無視2" : [ 0 /*武器系レジェ40%*/
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]

  , "秒 全スキルのクールタイム減少1" : [ 0
    , [/*レジェ*/
        [100, 1]
      ]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "秒 全スキルのクールタイム減少2" : [ 0
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
    
  , "HP回復 攻撃時20%の確率" : [ 2 /* アディ15% アディMP共通 テンプレート名はそのまま */
    , [/*レジェ*/]
    , [/*ユニ*/
        [0, 40], [11, 45], [21, 50], [31, 55], [41, 60], [51, 65], [61, 70], [71, 75], [81, 80], [91, 85], [101, 90], [111, 95]
      ]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "MP回復 攻撃時20%の確率" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/
        [0, 40], [11, 45], [21, 50], [31, 55], [41, 60], [51, 65], [61, 70], [71, 75], [81, 80], [91, 85], [101, 90], [111, 95]
      ]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
    
    
    
  , "HP回復 攻撃時3%の確率" : [ 2 /* 共通 MP回復 攻撃時3%の確率 */
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/
        [0, 20], [11, 23], [21, 26], [31, 29], [41, 32], [51, 35], [61, 38], [71, 41], [81, 44], [91, 47], [101, 50], [111, 53]
      ]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
    
    
    
  , "HP回復 モンスター退治時15%の確率" : [ 2 /*共通 MP回復 モンスター退治時15%の確率*/
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "HP回復 4秒ごと" : [ 2 /*共通 MP回復 4秒ごと*/
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]

  , "レベル中毒 攻撃時20%の確率" : [ 2 /*共通 レベル中毒 攻撃時10%の確率*/
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "レベル気絶 攻撃時10%の確率" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "レベルスロー 攻撃時20%の確率" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "レベル暗黒 攻撃時20%の確率" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "レベル氷結 攻撃時10%の確率" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "レベル封印 攻撃時10%の確率" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]

  , "被撃時10%の確率で10秒間を感じる" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]

  , "% 確率で攻撃時オートスチール1" : [ 1
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% 確率で攻撃時オートスチール2" : [ 1
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% 確率で攻撃時オートスチール3" : [ 1
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
    
  , "% HP回復効率" : [ 2
    , [/*レジェ*/
        [0, 10], [21, 15], [51, 20], [91, 30]
      ]
    , [/*ユニ*/
        [0,  5], [21, 10], [51, 15], [91, 20]
      ]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]

  , "秒 襲撃後の無敵時間" : [ 1
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "秒 被撃時x%で無敵" : [ 2 /*確率も等級によって変動*/
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
    
  , "%の確率で 被撃時20%のﾀﾞﾒｰｼﾞ無視" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "%の確率で 被撃時40%のﾀﾞﾒｰｼﾞ無視" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
    
    
  , "のﾀﾞﾒｰｼﾞ無視 被撃時%の確率で1" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "のﾀﾞﾒｰｼﾞ無視 被撃時%の確率で2" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "のﾀﾞﾒｰｼﾞ無視 被撃時%の確率で3" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
    
  , "%の確率で 被撃時x%のﾀﾞﾒｰｼﾞ反射1" : [ 2 //反射量も変動
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "%の確率で 被撃時x%のﾀﾞﾒｰｼﾞ反射2" : [ 2 //反射量も変動
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% 消費MP減少1" : [ 2
    , [/*レジェ*/
        [0, 3], [21, 5], [51, 7], [91, 10]
      ]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% 消費MP減少2" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "% アイテムドロップ率" : [ 0 /*共通 メル獲得量*/
    , [/*レジェ*/
        [0, 2], [21, 3], [51, 4], [91, 5]
      ]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]


  , "% 防御力" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/
        [0, 1], [31, 2], [71, 4], [201, 5]
      ]
    , [/*レア*/
        [0, 1], [91, 2], [201, 3]
      ]
    , [/*ノーマル*/]
    ]
  , "防御力" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/
        [0, 15], [21, 20], [51, 60], [91, 120], [201, 150]
      ]
    , [/*レア*/
        [0, 10], [21, 15], [51, 50], [91, 100], [201, 125]
      ]
    , [/*ノーマル*/
        [0, 5], [11, 10], [21, 15], [31, 20], [41, 25], [51, 30], [61, 35], [71, 40], [81, 45], [91, 50], [101, 55], [111, 60]
      ]
    ]
  , "移動速度" : [ 2 /*共通 ジャンプ力*/
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/
        [0, 4], [31, 6], [111, 8], [201, 9]
      ]
    , [/*レア*/
        [0, 2], [21, 3], [51, 4], [81, 5], [111, 6]
      ]
    , [/*ノーマル*/
        [0, 1], [31, 2], [71, 3], [111, 4]
      ]
    ]

  , "ﾊﾟｻｰﾌﾞﾙ ｳｨﾝﾄﾞﾌﾞｰｽﾀｰ" : [ 0
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "ﾊﾟｻｰﾌﾞﾙ ｼｬｰﾌﾟｱｲｽﾞ" : [ 0
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "ﾊﾟｻｰﾌﾞﾙ ｱﾄﾞﾊﾞﾝｽﾌﾞﾚｽ" : [ 0
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "ﾊﾟｻｰﾌﾞﾙ ﾐｽﾃｨｯｸﾄﾞｱ" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "ﾊﾟｻｰﾌﾞﾙ ｺﾝﾊﾞｯﾄｵｰﾀﾞｰ" : [ 0
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "ﾊﾟｻｰﾌﾞﾙ ﾍｲｽﾄ" : [ 2
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
  , "ﾊﾟｻｰﾌﾞﾙ ﾊｲﾊﾟｰﾎﾞﾃﾞｨ" : [ 0
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]

    
  , "% ドロップ率" : [ 1
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]



  , "temp" : [ 0
    , [/*レジェ*/]
    , [/*ユニ*/]
    , [/*エピ*/]
    , [/*レア*/]
    , [/*ノーマル*/]
    ]
   
  };


  /*----------- 潜在能力表示名設定 ---------------------------------------*/
  let pt = data.potentialinfotemplate;
  let list = commons.createpotentialinfolist(data);
  data.potentialinfolist = list;
  list[commons.consts.ohp1][0] = "HP回復 攻撃時15%の確率";
  list[commons.consts.omp1][1] = "MP回復 攻撃時15%の確率";
  

  /*=============== 汎用最終処理 ==========================================*/
  with(commons.consts){
    /* data.ratetableを扱いやすいように書き換え */
    for( let k of Object.keys(data.ratetable) ){
      data.ratetable[k].map( (e, i, arr) =>{
        if(!e) return;
        arr[i] = e.map( r => [ r, new BigNumber(1).minus( r ) ] );
      });
    }
  
    /* 潜在の重複制限 [制限グループ[], 制限数] */
    data.potentialerrorlist = [
      [[oinv], 1]
    , [[opinv], 2]
    , [[pboss1, pboss2], 2]
    , [[pign1, pign2], 2]
    , [[pigndam1, pigndam2], 2]
    , [[pdrop], 2]
    ];
  
    /* 潜在IDから参照する用 */
    data.potentialerrorlist2 = [];
    data.potentialerrorlist.forEach((e, i)=>{
      e[0].forEach((pid)=>{
        data.potentialerrorlist2[pid] = i;
      });
    });
  }


};






